Revit 2027 API
RevitLinkType.UpdateFromIFC Method
Overload List
Name | Description
UpdateFromIFC(Document, ExternalResourceReference, String, Boolean) |  Updates a Revit link type from an IFC file and loads the linked document.
UpdateFromIFC(Document, String, String, Boolean) |  Updates a Revit link type from an IFC file and loads the linked document.
Top
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace